Glastis/MargouLan/cmake-build-debug/esp8266_lamp_esp8266_lamp.ino.cpp
// automatically generated by arduino-cmake
#line 1 "/cygdrive/c/Users/Luciano/Dropbox/esp8266/esp8266-01/lamp/esp8266_lamp.ino"
#include <Arduino.h>
#include <ESP8266WiFi.h>

#include "main.h"


#line 9 "/cygdrive/c/Users/Luciano/Dropbox/esp8266/esp8266-01/lamp/cmake-build-debug/esp8266_lamp_esp8266_lamp.ino.cpp"
#include "Arduino.h"

//=== START Forward: /cygdrive/c/Users/Luciano/Dropbox/esp8266/esp8266-01/lamp/esp8266_lamp.ino
 void setup() ;
 void setup() ;
 void loop() ;
 void loop() ;
//=== END Forward: /cygdrive/c/Users/Luciano/Dropbox/esp8266/esp8266-01/lamp/esp8266_lamp.ino
#line 5 "/cygdrive/c/Users/Luciano/Dropbox/esp8266/esp8266-01/lamp/esp8266_lamp.ino"


WiFiServer server(WEB_SERVER_PORT);//Service Port

void setup() {
    Serial.begin(BAUDRATE);
    delay(10);

    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);

// Connect to WiFi network
    Serial.println();
    Serial.print("Connecting to ");
    Serial.println(WIFI_SSID);

    WiFi.begin(WIFI_SSID, WIFI_PASS);

    while (WiFi.status() != WL_CONNECTED) {
        delay(CONNECT_RETRY_DELAY);
        Serial.print(".");
    }
    Serial.println("");
    Serial.println("WiFi connected");

// Start the server
    server.begin();
    Serial.println("Server started");

// Print the IP address
    Serial.print("Use this URL to connect: ");
    Serial.print("http://");
    Serial.print(WiFi.localIP());
    Serial.println("/");
}

void loop() {
// Check if a client has connected
    WiFiClient client = server.available();
    if (!client) {
        return;
    }

// Wait until the client sends some data
    Serial.println("new client");
    while(!client.available()){
        delay(CLIENT_DATA_DELAY);
    }

// Read the first line of the request
    String request = client.readStringUntil('\r');
    Serial.println(request);
    client.flush();

// Match the request

    int value = LOW;
    if (request.indexOf("/LED=ON") != -1) {
        digitalWrite(LED_PIN, HIGH);
        value = HIGH;
    }
    if (request.indexOf("/LED=OFF") != -1){
        digitalWrite(LED_PIN, LOW);
        value = LOW;
    }

//Set LED_PIN according to the request
//digitalWrite(LED_PIN, value);

// Return the response
    client.println("HTTP/1.1 200 OK");
    client.println("Content-Type: text/html");
    client.println(""); //  do not forget this one
    client.println("<!DOCTYPE HTML>");
    client.println("<html>");

    client.print("Led pin is now: ");

    if(value == HIGH) {
        client.print("On");
    } else {
        client.print("Off");
    }
    client.println("<br><br>");
    client.println("Click <a href=\"/LED=ON\">here</a> turn the LED on pin 2 ON<br>");
    client.println("Click <a href=\"/LED=OFF\">here turn the LED on pin 2 OFF<br>");
    client.println("</html>");

    delay(1);
    Serial.println("Client disconnected");
    Serial.println("");
}
